config.org
* Misc
#+BEGIN_SRC emacs-lisp
  (menu-bar-mode -1)
  (toggle-scroll-bar -1)
  (tool-bar-mode -1)
  (blink-cursor-mode -1)
  (global-hl-line-mode +1)
  (line-number-mode +1)
  (global-display-line-numbers-mode 1)
  (column-number-mode t)
  (size-indication-mode t)
  (setq-default tab-width 4
                indent-tabs-mode nil)
  (add-hook 'before-save-hook 'whitespace-cleanup)
#+END_SRC

* Theme
#+BEGIN_SRC emacs-lisp
  (add-to-list 'custom-theme-load-path "~/.emacs.d/everforest-theme")
  (load-theme 'everforest-hard-dark t)
#+END_SRC

* Dashboard
#+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook))
#+END_SRC

* Evil Mode
#+BEGIN_SRC emacs-lisp
  (use-package evil
    :ensure t
    :init
    (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
    (setq evil-want-keybinding nil)
    :config
    (evil-mode 1))

  (use-package magit
   :ensure t)

  (use-package evil-collection
    :after evil
    :ensure t
    :config
    (evil-collection-init))
#+END_SRC

* Org Mode
#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))

  (setq org-startup-indented t
     org-ellipsis "  "
     org-pretty-entities t
     org-hide-emphasis-markers t
     org-agenda-block-separator ""
     org-fontify-whole-heading-line t
     org-fontify-done-headline t
     org-fontify-quote-and-verse-blocks t)

  (add-hook 'org-mode-hook (lambda ()
     "Beautify Org Checkbox Symbol"
     (push '("[ ]" .  "☐") prettify-symbols-alist)
     (push '("[X]" . "☑" ) prettify-symbols-alist)
     (push '("[-]" . "❍" ) prettify-symbols-alist)
     (push '("#+BEGIN_SRC" . "↦" ) prettify-symbols-alist)
     (push '("#+END_SRC" . "⇤" ) prettify-symbols-alist)
     (push '("#+BEGIN_EXAMPLE" . "↦" ) prettify-symbols-alist)
     (push '("#+END_EXAMPLE" . "⇤" ) prettify-symbols-alist)
     (push '("#+BEGIN_QUOTE" . "↦" ) prettify-symbols-alist)
     (push '("#+END_QUOTE" . "⇤" ) prettify-symbols-alist)
     (push '("#+begin_quote" . "↦" ) prettify-symbols-alist)
     (push '("#+end_quote" . "⇤" ) prettify-symbols-alist)
     (push '("#+begin_example" . "↦" ) prettify-symbols-alist)
     (push '("#+end_example" . "⇤" ) prettify-symbols-alist)
     (push '("#+begin_src" . "↦" ) prettify-symbols-alist)
     (push '("#+end_src" . "⇤" ) prettify-symbols-alist)
     (prettify-symbols-mode)))
#+END_SRC
